_posts/2021-12-26-abc233-c-upsolving.html
---
title: ABC233 C - Product
tags: AtCoder DFS
---

<div id="outline-container-org887dbcd" class="outline-2">
<h2 id="org887dbcd">C - Product</h2>
<div class="outline-text-2" id="text-org887dbcd">
<ul class="org-ul">
<li>N개의 가방에서 하나씩 공을 꺼내서 곱해서 값 X를 만드는 경우의 수 구하기</li>
</ul>
</div>
</div>
<div id="outline-container-org8eb84f5" class="outline-2">
<h2 id="org8eb84f5">코드</h2>
<div class="outline-text-2" id="text-org8eb84f5">
<ul class="org-ul">
<li>dfs스타일로 풀이 가능함 (에디토리얼 보고 생각함)</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">X</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">cnt</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span>&lt; <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">ll</span>&gt; &gt; <span style="color: #ff6347;">G</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>, <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (idx == N) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (ans == X) {
            cnt += 1;
        }
        <span style="color: #729fcf; font-weight: bold;">return</span>;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">val</span>:G[idx]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (ans*val &gt; X) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        dfs(idx+1, ans*val);
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    cnt = 0;
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %lld"</span>, &amp;N, &amp;X);
    G.resize(N);    
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num); 
        G[i].resize(num);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;num;j++) {
            <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">val</span>;
            scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld"</span>, &amp;val);
            G[i][j] = val;
        }
    }
    dfs(0, 1);
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, cnt);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd95417" class="outline-2">
<h2 id="orgcd95417">문제 링크</h2>
<div class="outline-text-2" id="text-orgcd95417">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc233/tasks/abc233_c">https://atcoder.jp/contests/abc233/tasks/abc233_c</a></li>
</ul>
</div>
</div>
